bench/mysql.log
sysbench 1.0.20 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 3
Report intermediate results every 5 second(s)
Initializing random number generator from current time

Forcing shutdown in 301 seconds

Initializing worker threads...

Threads started!

[ 5s ] thds: 3 tps: 1175.75 qps: 34107.80 (r/w/o: 34107.80/0.00/0.00) lat (ms,95%): 3.36 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 3 tps: 1126.74 qps: 32673.97 (r/w/o: 32673.97/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 3 tps: 1138.17 qps: 33004.41 (r/w/o: 33004.41/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 3 tps: 1116.18 qps: 32371.21 (r/w/o: 32371.21/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 3 tps: 1092.97 qps: 31696.46 (r/w/o: 31696.46/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 3 tps: 1106.43 qps: 32081.15 (r/w/o: 32081.15/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 3 tps: 1094.36 qps: 31741.47 (r/w/o: 31741.47/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 3 tps: 1130.16 qps: 32769.81 (r/w/o: 32769.81/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 3 tps: 1099.47 qps: 31885.10 (r/w/o: 31885.10/0.00/0.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 3 tps: 1097.40 qps: 31828.94 (r/w/o: 31828.94/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 3 tps: 1103.39 qps: 32001.81 (r/w/o: 32001.81/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 3 tps: 1115.01 qps: 32330.15 (r/w/o: 32330.15/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 3 tps: 1124.22 qps: 32605.08 (r/w/o: 32605.08/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 3 tps: 1140.58 qps: 33080.59 (r/w/o: 33080.59/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 3 tps: 1118.81 qps: 32440.19 (r/w/o: 32440.19/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 3 tps: 1136.19 qps: 32949.57 (r/w/o: 32949.57/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 3 tps: 1143.63 qps: 33163.65 (r/w/o: 33163.65/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 3 tps: 1133.20 qps: 32862.36 (r/w/o: 32862.36/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 3 tps: 1070.37 qps: 31048.07 (r/w/o: 31048.07/0.00/0.00) lat (ms,95%): 3.68 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 3 tps: 1071.00 qps: 31052.14 (r/w/o: 31052.14/0.00/0.00) lat (ms,95%): 3.68 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 3 tps: 1093.79 qps: 31724.99 (r/w/o: 31724.99/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 3 tps: 1084.20 qps: 31440.74 (r/w/o: 31440.74/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 3 tps: 1040.21 qps: 30158.89 (r/w/o: 30158.89/0.00/0.00) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 3 tps: 1046.72 qps: 30359.94 (r/w/o: 30359.94/0.00/0.00) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 3 tps: 1063.25 qps: 30833.76 (r/w/o: 30833.76/0.00/0.00) lat (ms,95%): 3.68 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 3 tps: 1054.98 qps: 30597.36 (r/w/o: 30597.36/0.00/0.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 135s ] thds: 3 tps: 1031.22 qps: 29902.81 (r/w/o: 29902.81/0.00/0.00) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 3 tps: 1058.03 qps: 30688.71 (r/w/o: 30688.71/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 145s ] thds: 3 tps: 1044.15 qps: 30273.47 (r/w/o: 30273.47/0.00/0.00) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 3 tps: 1024.23 qps: 29704.62 (r/w/o: 29704.62/0.00/0.00) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 155s ] thds: 3 tps: 1039.98 qps: 30160.12 (r/w/o: 30160.12/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 3 tps: 1037.02 qps: 30074.30 (r/w/o: 30074.30/0.00/0.00) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 165s ] thds: 3 tps: 1020.49 qps: 29591.71 (r/w/o: 29591.71/0.00/0.00) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 3 tps: 981.08 qps: 28451.03 (r/w/o: 28451.03/0.00/0.00) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 175s ] thds: 3 tps: 987.00 qps: 28625.44 (r/w/o: 28625.44/0.00/0.00) lat (ms,95%): 4.10 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 3 tps: 986.41 qps: 28607.22 (r/w/o: 28607.22/0.00/0.00) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 185s ] thds: 3 tps: 979.74 qps: 28416.17 (r/w/o: 28416.17/0.00/0.00) lat (ms,95%): 4.18 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 3 tps: 989.18 qps: 28683.96 (r/w/o: 28683.96/0.00/0.00) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 195s ] thds: 3 tps: 1030.86 qps: 29893.65 (r/w/o: 29893.65/0.00/0.00) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 3 tps: 1054.41 qps: 30578.47 (r/w/o: 30578.47/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 205s ] thds: 3 tps: 1052.78 qps: 30528.21 (r/w/o: 30528.21/0.00/0.00) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 3 tps: 1056.42 qps: 30632.36 (r/w/o: 30632.36/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 215s ] thds: 3 tps: 1080.05 qps: 31325.62 (r/w/o: 31325.62/0.00/0.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 3 tps: 1091.20 qps: 31642.15 (r/w/o: 31642.15/0.00/0.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 225s ] thds: 3 tps: 1078.16 qps: 31265.85 (r/w/o: 31265.85/0.00/0.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 3 tps: 1076.60 qps: 31226.33 (r/w/o: 31226.33/0.00/0.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 235s ] thds: 3 tps: 1055.20 qps: 30600.85 (r/w/o: 30600.85/0.00/0.00) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 3 tps: 1082.80 qps: 31404.94 (r/w/o: 31404.94/0.00/0.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 245s ] thds: 3 tps: 1023.01 qps: 29666.16 (r/w/o: 29666.16/0.00/0.00) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 3 tps: 1062.23 qps: 30795.64 (r/w/o: 30795.64/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 255s ] thds: 3 tps: 1053.98 qps: 30570.68 (r/w/o: 30570.68/0.00/0.00) lat (ms,95%): 3.68 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 3 tps: 1053.39 qps: 30547.05 (r/w/o: 30547.05/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 265s ] thds: 3 tps: 1076.96 qps: 31229.58 (r/w/o: 31229.58/0.00/0.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 3 tps: 1061.61 qps: 30790.56 (r/w/o: 30790.56/0.00/0.00) lat (ms,95%): 3.68 err/s: 0.00 reconn/s: 0.00
[ 275s ] thds: 3 tps: 1083.16 qps: 31407.30 (r/w/o: 31407.30/0.00/0.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 3 tps: 1047.64 qps: 30382.06 (r/w/o: 30382.06/0.00/0.00) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 285s ] thds: 3 tps: 1038.22 qps: 30111.80 (r/w/o: 30111.80/0.00/0.00) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 3 tps: 1008.42 qps: 29241.13 (r/w/o: 29241.13/0.00/0.00) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 295s ] thds: 3 tps: 1007.93 qps: 29230.64 (r/w/o: 29230.64/0.00/0.00) lat (ms,95%): 4.03 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 3 tps: 1011.43 qps: 29335.80 (r/w/o: 29335.80/0.00/0.00) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            9292064
        write:                           0
        other:                           0
        total:                           9292064
    transactions:                        320416 (1068.03 per sec.)
    queries:                             9292064 (30973.01 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0037s
    total number of events:              320416

Latency (ms):
         min:                                    1.62
         avg:                                    2.81
         max:                                   19.01
         95th percentile:                        3.75
         sum:                               899519.67

Threads fairness:
    events (avg/stddev):           106805.3333/116.29
    execution time (avg/stddev):   299.8399/0.00